export interface pollSchema {
  台中: number[];
  新北: number[];
  桃園: number[];
  台南: number[];
  高雄: number[];
  台北: number[];
  title: string;
  subTitle: string;
}

interface pollsSchema {
  施政表現: pollSchema;
  防疫表現: pollSchema;
  居民幸福: pollSchema;
  城市光榮: pollSchema;
  經濟發展: pollSchema;
  治安維護: pollSchema;
  交通改善: pollSchema;
  市容環境: pollSchema;
  長照資源: pollSchema;
}
export const stackedHorizontalDefaultData = {
  subTitle: "stacked horizontal bar chart subtitle",
  title: "stacked horizontal bar chart title",
  台中: [30.1, 41.0, 15.4, 8.7, 4.8],
  台北: [19.8, 28.6, 27.3, 18.7, 5.6],
  台南: [21.5, 34.1, 22.4, 16.9, 5.1],
  新北: [25.6, 37.9, 18.8, 13.1, 4.6],
  桃園: [30.1, 41.0, 15.4, 8.7, 4.8],
  高雄: [22.8, 31.0, 25.2, 15.7, 5.3],
}
export const polls: pollsSchema = {
  交通改善: {
    subTitle: "您對於（六都）市政府在改善交通的整體表現滿不滿意？",
    title: "交通滿意度",
    台中: [30.1, 41.0, 15.4, 8.7, 4.8],
    台北: [19.8, 28.6, 27.3, 18.7, 5.6],
    台南: [21.5, 34.1, 22.4, 16.9, 5.1],
    新北: [25.6, 37.9, 18.8, 13.1, 4.6],
    桃園: [30.1, 41.0, 15.4, 8.7, 4.8],
    高雄: [22.8, 31.0, 25.2, 15.7, 5.3],
  },
  城市光榮: {
    subTitle: "您是否會以居住在（六都）為榮？",
    title: "城市光榮感",
    台中: [21.3, 35.6, 26.5, 9.7, 6.9],
    台北: [17.6, 25.9, 31.0, 20.7, 4.8],
    台南: [34.1, 42.7, 13.6, 4.4, 5.2],
    新北: [23.0, 48.3, 18.2, 4.5, 6.1],
    桃園: [21.3, 35.6, 26.5, 9.7, 6.9],
    高雄: [20.8, 33.0, 20.2, 20.7, 5.3],
  },
  居民幸福: {
    subTitle: "整體來說，您覺得居住在（六都）幸福嗎？",
    title: "居民幸福感",
    台中: [30.1, 41.0, 15.4, 8.7, 4.8],
    台北: [19.8, 28.6, 27.3, 18.7, 5.6],
    台南: [21.5, 34.1, 22.4, 16.9, 5.1],
    新北: [25.6, 37.9, 18.8, 13.1, 4.6],
    桃園: [30.1, 41.0, 15.4, 8.7, 4.8],
    高雄: [22.8, 31.0, 25.2, 15.7, 5.3],
  },
  市容環境: {
    subTitle: "您對於（六都）市政府在維護市容環境的整體表現滿不滿意？",
    title: "市容環境滿意度",
    台中: [21.3, 35.6, 26.5, 9.7, 6.9],
    台北: [17.6, 25.9, 31.0, 20.7, 4.8],
    台南: [34.1, 42.7, 13.6, 4.4, 5.2],
    新北: [23.0, 48.3, 18.2, 4.5, 6.1],
    桃園: [21.3, 35.6, 26.5, 9.7, 6.9],
    高雄: [20.8, 33.0, 20.2, 20.7, 5.3],
  },
  施政表現: {
    subTitle: "整體來說，您對於（六都市長）的施政表現滿不滿意？",
    title: "施政滿意度",
    台中: [30.1, 41.0, 15.4, 8.7, 4.8],
    台北: [19.8, 28.6, 27.3, 18.7, 5.6],
    台南: [21.5, 34.1, 22.4, 16.9, 5.1],
    新北: [25.6, 37.9, 18.8, 13.1, 4.6],
    桃園: [30.1, 41.0, 15.4, 8.7, 4.8],
    高雄: [22.8, 31.0, 25.2, 15.7, 5.3],
  },
  治安維護: {
    subTitle: "您對於（六都）市政府維護地方治安的整體表現滿不滿意？",
    title: "治安滿意度",
    台中: [21.3, 35.6, 26.5, 9.7, 6.9],
    台北: [17.6, 25.9, 31.0, 20.7, 4.8],
    台南: [34.1, 42.7, 13.6, 4.4, 5.2],
    新北: [23.0, 48.3, 18.2, 4.5, 6.1],
    桃園: [21.3, 35.6, 26.5, 9.7, 6.9],
    高雄: [20.8, 33.0, 20.2, 20.7, 5.3],
  },
  經濟發展: {
    subTitle: "您對於（六都）市政府在促進地方經濟發展的整體表現滿不滿意？",
    title: "經濟滿意度",
    台中: [30.1, 41.0, 15.4, 8.7, 4.8],
    台北: [19.8, 28.6, 27.3, 18.7, 5.6],
    台南: [21.5, 34.1, 22.4, 16.9, 5.1],
    新北: [25.6, 37.9, 18.8, 13.1, 4.6],
    桃園: [30.1, 41.0, 15.4, 8.7, 4.8],
    高雄: [22.8, 31.0, 25.2, 15.7, 5.3],
  },
  長照資源: {
    subTitle: "您對於（六都）市政府提供的長照資源與服務滿不滿意？",
    title: "長照服務滿意度",
    台中: [30.1, 41.0, 15.4, 8.7, 4.8],
    台北: [19.8, 28.6, 27.3, 18.7, 5.6],
    台南: [21.5, 34.1, 22.4, 16.9, 5.1],
    新北: [25.6, 37.9, 18.8, 13.1, 4.6],
    桃園: [30.1, 41.0, 15.4, 8.7, 4.8],
    高雄: [22.8, 31.0, 25.2, 15.7, 5.3],
  },
  防疫表現: {
    subTitle: "您對（六都）從2020年新冠肺炎疫情爆發後的防疫表現滿不滿意？",
    title: "防疫滿意度",
    台中: [21.3, 35.6, 26.5, 9.7, 6.9],
    台北: [17.6, 25.9, 31.0, 20.7, 4.8],
    台南: [34.1, 42.7, 13.6, 4.4, 5.2],
    新北: [23.0, 48.3, 60.5, 18.2, 6.1],
    桃園: [21.3, 35.6, 26.5, 9.7, 6.9],
    高雄: [20.8, 33.0, 20.2, 20.7, 5.3],
  },
};
